OBauck/stm32_wav_player/Src/main.c
		if((bytesread < 44) || (res != FR_OK))
		{
			printf("Failed to read file\n");
		}
		else
		{
			uint16_t channels = header[22] + (header[23]<<8);
			uint32_t sample_rate = header[24] + (header[25]<<8) + (header[26]<<16) + (header[27]<<24);
			uint16_t bits_per_sample = header[34] + (header[35]<<8);
			
			printf("channels: %d\n", channels);
			printf("sample rate: %d\n", sample_rate);
			printf("bits per sample: %d\n", bits_per_sample);
			
			uint32_t count = 0;
			int32_t pcm_value;
			
			//fill up pwm buffer before we start
			
			//lower half
			res = f_read(&MyFile, buffer, BUFFER_SIZE, (UINT*)&bytesread);
			if(res != FR_OK)
			{
				printf("Read failed, count: %d\n", count);
				end_of_file = true;
			}
			
			if(bytesread != BUFFER_SIZE)
			{
				printf("read less bytes than buffersize: %d\n", bytesread);
			}
			
			count++;
			for(uint16_t i = 0; i < bytesread; i+=2)
			{
				pcm_value = (int32_t)(buffer[i] + (buffer[i+1]<<8));
				pwm_dma_buffer[i/2] = ((uint16_t)(pcm_value + 32768))>>5;
			}
			
			//upper half
			res = f_read(&MyFile, buffer, BUFFER_SIZE, (UINT*)&bytesread);
			if(res != FR_OK)
			{
				printf("Read failed, count: %d\n", count);
				end_of_file = true;
			}
			
			if(bytesread != BUFFER_SIZE)
			{
				printf("read less bytes than buffersize: %d\n", bytesread);
			}
			
			count++;
			for(uint16_t i = 0; i < bytesread; i+=2)
			{
				pcm_value = (int32_t)(buffer[i] + (buffer[i+1]<<8));
				pwm_dma_buffer[i/2 + BUFFER_SIZE/2] = ((uint16_t)(pcm_value + 32768))>>5;
			}
			
			//start PWM
			HAL_TIM_PWM_Start_DMA(&htim1, TIM_CHANNEL_1, (uint32_t *)pwm_dma_buffer, BUFFER_SIZE);

			HAL_TIMEx_PWMN_Start(&htim1, TIM_CHANNEL_1);
			
			pwm_dma_ready = false;
			
			//loop until the end of file
			while(end_of_file == false)
			{
				if(pwm_dma_ready)
				{
					res = f_read(&MyFile, buffer, BUFFER_SIZE, (UINT*)&bytesread);
					if(res != FR_OK)
					{
						printf("Read failed, count: %d\n", count);
						break;
					}
					
					if(bytesread != BUFFER_SIZE)
					{
						printf("read less bytes than buffersize: %d\n", bytesread);
					}
					
					if(f_eof(&MyFile))
					{
						printf("end of file\n");
						end_of_file = true;
					}
					
					for(uint16_t i = 0; i < bytesread; i+=2)
					{
						if(pwm_dma_lower_half)
						{
							pcm_value = (int32_t)(buffer[i] + (buffer[i+1]<<8));
							pwm_dma_buffer[i/2] = ((uint16_t)(pcm_value + 32768))>>5;
						}
						else
						{
							pcm_value = (int32_t)(buffer[i] + (buffer[i+1]<<8));
							pwm_dma_buffer[i/2 + BUFFER_SIZE/2] = ((uint16_t)(pcm_value + 32768))>>5;
						}
					}
					
					pwm_dma_ready = false;
					count++;
				}
			}
		}
	}
	printf("playback done\n");
}

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_TIM1_Init();
  MX_FATFS_Init();
  MX_SPI2_Init();
  MX_TIM2_Init();
  MX_USART2_UART_Init();

  /* USER CODE BEGIN 2 */
	
	printf("Up and running\r\n");
	
	htim1.hdma[TIM_DMA_ID_CC1]->XferHalfCpltCallback = HAL_TIM_PWM_PulseHalfFinishedCallback;
	HAL_TIM_Base_Start_IT(&htim2);

	if (f_mount(&fatfs, USER_Path, 0) != FR_OK)
	{
		printf("error in mounting disk\n");
	}
	else
	{
		printf("disk mounted\n");
		//read_file();
		playback();
	}

	
	/*
	int rc;

	// Check function/compatibility of the physical drive #0
	rc = test_diskio(0, 3, buff, sizeof buff);
	if (rc) {
			printf("Sorry the function/compatibility test failed. (rc=%d)\nFatFs will not work on this disk driver.\n", rc);
	} else {
			printf("Congratulations! The disk driver works well.\n");
	}
	*/
	
	//play_tone((tone_t){880, 1000, 64});
	//play_tone((tone_t){1000, 1000, 64});
	
	/*
	pwm_dma_buffer[0] = PWM_PERIOD + PWM_PERIOD/2;
	pwm_dma_buffer[1] = PWM_PERIOD - PWM_PERIOD/2;

	
	HAL_TIM_PWM_Start_DMA(&htim1, TIM_CHANNEL_1, (uint32_t *)pwm_dma_buffer, 2);

	HAL_TIMEx_PWMN_Start(&htim1, TIM_CHANNEL_1);
	
	HAL_Delay(1000);
	
	HAL_TIM_PWM_Stop_DMA(&htim1, TIM_CHANNEL_1);
	HAL_TIMEx_PWMN_Stop(&htim1, TIM_CHANNEL_1);
	*/
	
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

		HAL_GPIO_TogglePin(LD2_GPIO_Port, LD2_Pin);
		HAL_Delay(500);
		
  }
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI_DIV2;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL16;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

